# Pandas
<img src='pandas.png'>`
$$ $$ 
<li>Pandas is an open-source library that is built on top of NumPy library</li>
$$ $$
<li> It's a Python package that offers various data structures and operations for manipulating  data</li>
$$ $$ 
<li>It is mainly popular for importing and analyzing data much easier.</li>
$$ $$ 
<li>Pandas is fast and it has high-performance & productivity for users.</li>

In [1]:
#Importing Numpu 
import numpy as np
#Importing Pandas
import pandas as pd

## Creating Data 
$$ $$
<li>There are two core objects in pandas: the <b>DataFrame and the Series</b>.</li>
$$ $$ 
<b>Series:</b> A Pandas Series is like a column in a table.It is a one-dimensional array holding data of any type
$$ $$ 
<b>DataFrame:</b> A DataFrame is two-dimensional data structure, i.e., data is aligned in a tabular fashion
    $$ $$ 
<li>It contains an array of individual entries, each of which has a certain value.
    $$ $$ 
<li>Each entry corresponds to a <b> row (or record) and a column</b>.

In [2]:
#Create a simple Pandas Series from a list
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [3]:
print(myvar[0])

1

In [4]:
#Create your own labels
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [5]:
print(myvar["y"])

7

In [6]:
#Key/Value Objects as Series
import pandas as pd
calories = {"day1": 420, "day2": 380, "day3": 390} #Note: The keys of the dictionary become the labels.
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [7]:
#Create a Series using only data from "day1" and "day2":
myvar = pd.Series(calories, index = ["day1", "day2"])
print(myvar)

day1    420
day2    380
dtype: int64

In [8]:
#Create a DataFrame from two Series:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

In [9]:
#Named Indexs
df = pd.DataFrame(data, index = ["day1", "day2", "day3"])
df

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [10]:
#Creating a DataFrame by passing a dictionary of objects 
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

### Data Selection

In [12]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.474640 -1.365257 -0.860533 -1.340980
2013-01-02 -0.151325  0.908028 -0.146438  0.724780
2013-01-03 -0.116590  1.301871  0.601519 -0.123011
2013-01-04  0.909721  0.344057  0.226711 -0.298496
2013-01-05  0.093794 -1.698447 -0.857612 -0.273074
2013-01-06  0.695136  0.116015 -0.248884 -0.401347

In [14]:
df.head()  #To view top5 records

                   A         B         C         D
2013-01-01  0.474640 -1.365257 -0.860533 -1.340980
2013-01-02 -0.151325  0.908028 -0.146438  0.724780
2013-01-03 -0.116590  1.301871  0.601519 -0.123011
2013-01-04  0.909721  0.344057  0.226711 -0.298496
2013-01-05  0.093794 -1.698447 -0.857612 -0.273074

In [15]:
df.tail(3) #To view bottom records

                   A         B         C         D
2013-01-04  0.909721  0.344057  0.226711 -0.298496
2013-01-05  0.093794 -1.698447 -0.857612 -0.273074
2013-01-06  0.695136  0.116015 -0.248884 -0.401347

In [16]:
df.index #Display the index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.describe() #shows a quick statistic summary of your data

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.317563 -0.065622 -0.214206 -0.285354
std    0.441883  1.214416  0.582635  0.659523
min   -0.151325 -1.698447 -0.860533 -1.340980
25%   -0.063994 -0.994939 -0.705430 -0.375634
50%    0.284217  0.230036 -0.197661 -0.285785
75%    0.640012  0.767035  0.133423 -0.160527
max    0.909721  1.301871  0.601519  0.724780

In [18]:
df.T #Transposing your data

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.474640   -0.151325   -0.116590    0.909721    0.093794    0.695136
B   -1.365257    0.908028    1.301871    0.344057   -1.698447    0.116015
C   -0.860533   -0.146438    0.601519    0.226711   -0.857612   -0.248884
D   -1.340980    0.724780   -0.123011   -0.298496   -0.273074   -0.401347

In [19]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.340980 -0.860533 -1.365257  0.474640
2013-01-02  0.724780 -0.146438  0.908028 -0.151325
2013-01-03 -0.123011  0.601519  1.301871 -0.116590
2013-01-04 -0.298496  0.226711  0.344057  0.909721
2013-01-05 -0.273074 -0.857612 -1.698447  0.093794
2013-01-06 -0.401347 -0.248884  0.116015  0.695136

In [20]:
#sorting by values
df.sort_values(by="B")

                   A         B         C         D
2013-01-05  0.093794 -1.698447 -0.857612 -0.273074
2013-01-01  0.474640 -1.365257 -0.860533 -1.340980
2013-01-06  0.695136  0.116015 -0.248884 -0.401347
2013-01-04  0.909721  0.344057  0.226711 -0.298496
2013-01-02 -0.151325  0.908028 -0.146438  0.724780
2013-01-03 -0.116590  1.301871  0.601519 -0.123011

In [21]:
#Selection of data
df["A"] #df.A

2013-01-01    0.474640
2013-01-02   -0.151325
2013-01-03   -0.116590
2013-01-04    0.909721
2013-01-05    0.093794
2013-01-06    0.695136
Freq: D, Name: A, dtype: float64

In [22]:
#Selecting via [], which slices the rows:
df[0:3]

                   A         B         C         D
2013-01-01  0.474640 -1.365257 -0.860533 -1.340980
2013-01-02 -0.151325  0.908028 -0.146438  0.724780
2013-01-03 -0.116590  1.301871  0.601519 -0.123011

In [23]:
#Label-based selection
df.loc[dates[0]]

A    0.474640
B   -1.365257
C   -0.860533
D   -1.340980
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
#Selecting on a multi-axis by label
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.474640 -1.365257
2013-01-02 -0.151325  0.908028
2013-01-03 -0.116590  1.301871
2013-01-04  0.909721  0.344057
2013-01-05  0.093794 -1.698447
2013-01-06  0.695136  0.116015

In [25]:
#Showing label slicing, both endpoints are included
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.151325  0.908028
2013-01-03 -0.116590  1.301871
2013-01-04  0.909721  0.344057

In [26]:
df.loc["20130102", ["A", "B"]]

A   -0.151325
B    0.908028
Name: 2013-01-02 00:00:00, dtype: float64

In [27]:
df.loc[dates[0], "A"]

0.47464040473643593

In [28]:
#For getting fast access to a scalar (equivalent to the prior method):
df.at[dates[0], "A"]

0.47464040473643593

In [29]:
#Selection by position - Select via the position of the passed integers:
df.iloc[3]

A    0.909721
B    0.344057
C    0.226711
D   -0.298496
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
#By integer slices, acting similar to NumPy/Python:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.909721  0.344057
2013-01-05  0.093794 -1.698447

In [31]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.151325 -0.146438
2013-01-03 -0.116590  0.601519
2013-01-05  0.093794 -0.857612

In [32]:
#For slicing rows explicitly
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.151325  0.908028 -0.146438  0.724780
2013-01-03 -0.116590  1.301871  0.601519 -0.123011

In [33]:
#For slicing columns explicitly:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.365257 -0.860533
2013-01-02  0.908028 -0.146438
2013-01-03  1.301871  0.601519
2013-01-04  0.344057  0.226711
2013-01-05 -1.698447 -0.857612
2013-01-06  0.116015 -0.248884

In [34]:
#For getting a value explicitly
df.iloc[1, 1]

0.9080279285220305

In [35]:
#For getting fast access to a scalar (equivalent to the prior method
df.iat[1, 1]

0.9080279285220305

<b>lov vs Iloc </b>
$$ $$
iloc uses the Python stdlib indexing scheme, where the first element of the range is included and the last one excluded. So 0:10 will select entries 0,...,9. loc, meanwhile, indexes inclusively. So 0:10 will select entries 0,...,10

In [36]:
#Boolean indexing
df[df > 0]

                   A         B         C        D
2013-01-01  0.474640       NaN       NaN      NaN
2013-01-02       NaN  0.908028       NaN  0.72478
2013-01-03       NaN  1.301871  0.601519      NaN
2013-01-04  0.909721  0.344057  0.226711      NaN
2013-01-05  0.093794       NaN       NaN      NaN
2013-01-06  0.695136  0.116015       NaN      NaN

In [37]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.474640 -1.365257 -0.860533 -1.340980
2013-01-04  0.909721  0.344057  0.226711 -0.298496
2013-01-05  0.093794 -1.698447 -0.857612 -0.273074
2013-01-06  0.695136  0.116015 -0.248884 -0.401347

### Missing Data
$$ $$ 
<b>pandas primarily uses the value np.nan to represent missing data

In [38]:
df1 = df[df > 0]
df1

                   A         B         C        D
2013-01-01  0.474640       NaN       NaN      NaN
2013-01-02       NaN  0.908028       NaN  0.72478
2013-01-03       NaN  1.301871  0.601519      NaN
2013-01-04  0.909721  0.344057  0.226711      NaN
2013-01-05  0.093794       NaN       NaN      NaN
2013-01-06  0.695136  0.116015       NaN      NaN

In [39]:
df1.dropna(how="any")

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [40]:
df1.fillna(value=5)

                   A         B         C        D
2013-01-01  0.474640  5.000000  5.000000  5.00000
2013-01-02  5.000000  0.908028  5.000000  0.72478
2013-01-03  5.000000  1.301871  0.601519  5.00000
2013-01-04  0.909721  0.344057  0.226711  5.00000
2013-01-05  0.093794  5.000000  5.000000  5.00000
2013-01-06  0.695136  0.116015  5.000000  5.00000

In [41]:
pd.isna(df1)

                A      B      C      D
2013-01-01  False   True   True   True
2013-01-02   True  False   True  False
2013-01-03   True  False  False   True
2013-01-04  False  False  False   True
2013-01-05  False   True   True   True
2013-01-06  False  False   True   True

### Operations

In [42]:
df.mean()

A    0.317563
B   -0.065622
C   -0.214206
D   -0.285354
dtype: float64

In [43]:
df.mean(1)

2013-01-01   -0.773032
2013-01-02    0.333761
2013-01-03    0.415947
2013-01-04    0.295498
2013-01-05   -0.683835
2013-01-06    0.040230
Freq: D, dtype: float64

In [44]:
#Apply
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.474640 -1.365257 -0.860533 -1.340980
2013-01-02  0.323316 -0.457229 -1.006971 -0.616199
2013-01-03  0.206725  0.844642 -0.405452 -0.739210
2013-01-04  1.116446  1.188699 -0.178741 -1.037706
2013-01-05  1.210240 -0.509747 -1.036353 -1.310780
2013-01-06  1.905376 -0.393732 -1.285237 -1.712127

In [45]:
df.apply(lambda x: x.max() - x.min())

A    1.061046
B    3.000317
C    1.462052
D    2.065760
dtype: float64

### Merge

In [46]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)


frames = [df1, df2, df3]

result = pd.concat(frames)

In [47]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [48]:
result = pd.concat(frames, keys=["x", "y", "z"])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [49]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)


result = pd.concat([df1, df4], axis=1)

In [50]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [51]:
#Join
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [52]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [53]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Grouping
$$ $$
By group by we are referring to a process involving one or more of the following steps:
$$ $$
<li>Splitting the data into groups based on some criteria
$$ $$
<li>Applying a function to each group independently
$$ $$
<li>Combining the results into a data structure

In [54]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one -0.979507  0.623642
1  bar    one  0.060677 -0.616523
2  foo    two  0.020002 -0.831853
3  bar  three  0.105385  1.086545
4  foo    two  0.356739 -0.049499
5  bar    two -0.466000  1.956923
6  foo    one  0.077674  1.239499
7  foo  three  0.243071 -1.508877

In [55]:
df.groupby("A").sum()

            C         D
A
bar -0.299938  2.426945
foo -0.282021 -0.527088

In [56]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.060677 -0.616523
    three  0.105385  1.086545
    two   -0.466000  1.956923
foo one   -0.901833  1.863141
    three  0.243071 -1.508877
    two    0.376741 -0.881352

### Getting data in/out

In [57]:
#Writing to a csv file:
df.to_csv("foo.csv")

In [58]:
#Reading from a csv file:
df = pd.read_csv("foo.csv")
df

   Unnamed: 0    A      B         C         D
0           0  foo    one -0.979507  0.623642
1           1  bar    one  0.060677 -0.616523
2           2  foo    two  0.020002 -0.831853
3           3  bar  three  0.105385  1.086545
4           4  foo    two  0.356739 -0.049499
5           5  bar    two -0.466000  1.956923
6           6  foo    one  0.077674  1.239499
7           7  foo  three  0.243071 -1.508877

In [59]:
#Writing to an excel file:
df.to_excel("foo.xlsx", sheet_name="Sheet1")

In [60]:
pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])

   Unnamed: 0  Unnamed: 0.1    A      B         C         D
0           0             0  foo    one -0.979507  0.623642
1           1             1  bar    one  0.060677 -0.616523
2           2             2  foo    two  0.020002 -0.831853
3           3             3  bar  three  0.105385  1.086545
4           4             4  foo    two  0.356739 -0.049499
5           5             5  bar    two -0.466000  1.956923
6           6             6  foo    one  0.077674  1.239499
7           7             7  foo  three  0.243071 -1.508877